posts/2015-03-27-the-crossshattered-christ-chapter-5.org
#+date: <2015-03-27>
#+filetags: religion
#+title: The Cross-Shattered Christ, Chapter 5

It is telling that the cry from the cross, "My God, my God, why have you forsaken me?" is followed by the simple declaration, "I thirst." We thirst for God, not because God has forsaken us, nor because we have forsaken God. We simply thirst for God — we thirst for God's mercy, we thirst for God's justice in this world, we thirst to be loved by God's people as God loves us. Relief from that thirst is "...found in the body and blood of our Lord that forever slakes our thirst. So refreshed, we become for the world the reminder that God has not abandoned us...."[fn:1]


[fn:1] Hauerwas, Stanley (2005-01-01). /Cross-Shattered Christ: Meditations on the Seven Last Words/ (p. 69). Baker Publishing Group. Kindle Edition.


#+begin_tagline
Tagged: [[file:../tags/religion.org][Religion]]
#+end_tagline
