docs/posts/2015-03-27-the-crossshattered-christ-chapter-5.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Cross-Shattered Christ, Chapter 5</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/rss.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Cross-Shattered Christ, Chapter 5</h1>
<p class="subtitle" role="doc-subtitle">Mar 27, 2015</p>
</header><p>
It is telling that the cry from the cross, &ldquo;My God, my God, why have you forsaken me?&rdquo; is followed by the simple declaration, &ldquo;I thirst.&rdquo; We thirst for God, not because God has forsaken us, nor because we have forsaken God. We simply thirst for God — we thirst for God&rsquo;s mercy, we thirst for God&rsquo;s justice in this world, we thirst to be loved by God&rsquo;s people as God loves us. Relief from that thirst is &ldquo;&#x2026;found in the body and blood of our Lord that forever slakes our thirst. So refreshed, we become for the world the reminder that God has not abandoned us&#x2026;.&rdquo;<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>


<div class="tagline" id="orgbe33d2c">
<p>
Tagged: <a href="../tags/religion.html">Religion</a>
</p>

</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes</h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Hauerwas, Stanley (2005-01-01). <i>Cross-Shattered Christ: Meditations on the Seven Last Words</i> (p. 69). Baker Publishing Group. Kindle Edition.
</p></div></div>


</div>
</div></main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
